package com.example.sagar.ahs;

import android.content.ContentValues;
import android.content.Context;
import android.database.Cursor;
import android.database.MatrixCursor;
import android.database.SQLException;
import android.database.sqlite.SQLiteDatabase;
import android.database.sqlite.SQLiteOpenHelper;
import android.util.Log;

import java.util.ArrayList;


public class AgroDatabase extends SQLiteOpenHelper {
         private  static  String DB_NAME="AgroData";
    private  static  String TABLE_VARIABLES="variables";
    private  static  String TABLE_USERINFO="userinfo";
    private static String TABLE_FIELDINFO="fieldinfo";
    private static String DataTable="cropSuggestion";

    private static int DB_VERSION=1;

    AgroDatabase(Context context)
    {super(context,DB_NAME,null,DB_VERSION);//null is for cursors//sqlite helper classes constructor is being called

    }

    @Override
    public void onCreate(SQLiteDatabase db){//Sqlitedatabase class gives us access to database

        db.execSQL("CREATE TABLE "+TABLE_VARIABLES+"("
            +"_id INTEGER PRIMARY KEY AUTOINCREMENT,"
            + "Crop_Name TEXT,"
            + "Temp_Max REAL,"
            + "Temp_Min REAL,"
            + "Humidity_Max REAL,"
            + "Humidity_Min REAL,"
            + "PH_Max REAL,"
            + "PH_Min REAL,"
            + "Rain REAL,"

            +"Time_To_Harvest INTEGER,"

            + "Sunshine_Days INTEGER);");
      /*  db.execSQL("CREATE TABLE "+TABLE_VARIABLES+"("
                +"_id INTEGER PRIMARY KEY AUTOINCREMENT,"
                + "Crop_Name TEXT,"
                + "Temp_Max INTEGER,"
                + "Temp_Min INTEGER,"
                + "Humidity_Max INTEGER,"
                + "Humidity_Min INTEGER,"
                + "PH_Max INTEGER,"
                + "PH_Min INTEGER,"
                + "Rain INTEGER,"

                +"Time_To_Harvest INTEGER,"

                + "Sunshine_Days INTEGER);");


*/
        db.execSQL("CREATE TABLE "+TABLE_USERINFO+"("
                + "_id INTEGER PRIMARY KEY AUTOINCREMENT,"
                + "User_Name TEXT,"
                + "Location TEXT,"
                +"CurrentNoFields INTEGER"
                +"Total Area TEXT"
                + "Crops_Grown TEXT);");
        db.execSQL("CREATE TABLE "+TABLE_FIELDINFO+"("
                + "_id INTEGER PRIMARY KEY AUTOINCREMENT,"
                + "FieldName TEXT,"
                + "Area TEXT,"
                + "Measure_Unit TEXT,"
                + "CropGrown TEXT,"
                + "SideCrop TEXT,"

                +"Growth_Start_Date TEXT,"
                +"Growth_End_Date TEXT);");
        db.execSQL("CREATE TABLE "+DataTable+"("
                + "_id INTEGER PRIMARY KEY AUTOINCREMENT,"
                +"Crop_name TEXT,"
                + "Fertilizer TEXT,"
                + "Storage TEXT,"
                + "Planting_Procedure TEXT);");
        insert_Data(db,"Rice",35,20,80,60,(float)6.5,(float)5.0,1400,150,6);
        insert_Data(db,"Wheat",12,30,60,50,(float)3.7,7,310,120,6);
        insert_Data(db,"Soybean",27,15,60,50,6,(float)6.8,60,100,6);
        insert_Data(db,"Strawberries",27,15,60,50,7,(float)3.7,310,120,6);
        insert_Data(db,"Peas",(float)24.1,(float)15.5,40,60,6,(float)7.5,0,70,6);
        insert_Data(db,"Potatoes",30,10,80,50,6,(float)4.5,0,110,6);
        insert_Data(db,"Pumpkin",32,21,60,40,7,(float)5.5,600,100,6);
        insert_Data(db,"Onions",35,21,60,40,7,6,0,100,6);
        insert_Data(db,"Corn",24,15,60,40,7,(float)5.5,0,75,6);
        insert_Data(db,"LimaBeans",24,18,60,40,7,6,0,80,6);

        insert_Data(db,"Cauliflower",27,16,80,70,7,(float)6.5,0,75,6);
        insert_Data(db,"Carrots",29,7,60,50,7,(float)5.5,0,70,6);
        insert_Data(db,"Cabbage",35,7,60,40,(float)7.5,6,0,70,6);
        insert_Data(db,"Broccoli",26,16,50,40,(float)7.5,6,0,70,6);
        insert_Data(db,"Turnip",30,15,50,40,7,(float)5.5,0,55,6);
        insert_Data(db,"Spinach",23,10,50,40,7,6,0,40,4);
        insert_Data(db,"Raddish",32,7,60,50,7,6,0,90,6);
        insert_Data(db,"Lettuce",24,4,70,50,7,6,0,90,6);
        insert_Data(db,"Garlic",24,13,65,50,(float)7.5,(float)5.5,0,140,6);
        insert_Data(db,"Cucumber",35,22,60,50,(float)7.5,(float)5.5,0,60,6);
/*        insert_Data(db,"Rice",35,20,80,60,6,5,1400,150,6);
        insert_Data(db,"Wheat",12,30,60,50,4,7,310,120,6);
        insert_Data(db,"Soybean",27,15,60,50,6,7,60,100,6);
        insert_Data(db,"Strawberries",27,15,60,50,7,4,310,120,6);
        insert_Data(db,"Peas",24,15,40,60,6,8,0,70,6);
        insert_Data(db,"Potatoes",30,10,80,50,6,4,0,110,6);
        insert_Data(db,"Pumpkin",32,21,60,40,7,5,600,100,6);
        insert_Data(db,"Onions",35,21,60,40,7,6,0,100,6);
        insert_Data(db,"Corn",24,15,60,40,7,5,0,75,6);
        insert_Data(db,"LimaBeans",24,18,60,40,7,6,0,80,6);


*/


        insert_Suggestion(db,"Potatoes",
                "आलु रोप्नु भन्दा पहिले मलको प्रयोग गर्न सकिन्छ । आलु रोप्नुभन्दा पहिले सतहमा मल छर्ने र सामान्य खनजोत गर्ने गर्नुपछ । यसपछि आलु लगाउने समयमा ड्याँगमा गोठेमलका साथै " +
                        "नाईट्रोजन र यूरिया प्रयोग गर्न सकिन्छ । अलुमा विषेश गरि नाईट्रोजन, यूरिया र पोटासको मिश्रण गराई प्रयोग गर्नु उपयुक्त हुन्छ ।",
                "",
                " आलुका लागि उपयुक्त माटो:\n" +
                        "\n" +
                        "आलु खेतिका लागि हल्का चिसो माटो आवश्यक पर्ने गर्छ । आलु लगाउनुभन्दा पहिले खन जोत गरि माटोलाई खुकुलो पार्नु पर्ने हुन्छ । बढि सुख्खा माटो भएमा सिचाई गर्न सकिन्छ तर सिचाई गरेको ३ देखी ५ दिन सम्म पर्खिई आलु लगाउँदा माटोमा पानीको मात्र आलुका लागि आवश्यकता अनुसारको हुन सक्छ ।\n" +
                        "\n" +
                        "२) जग्गा तयारी:\n" +
                        "\n" +
                        "आलु लगाउने खेत वा वारीलाई २ देखी ३ पल्ट सम्म गोड्नु पर्छ । गोडी सकेपछि त्यसमा खन जोत गरी भएका ठूला ठूला डल्लाहरुलाई फुटाई मसिनो वनाउनु पर्छ ।"+
                "सिचाई:\n" +
                        "\n" +
                        "आलुलाई फसल तयार हुन्जेल सम्म ३ देखी ५ पटक सम्म सिचाई गर्न सकिन्छ । सिचाईको मात्रा मिलाउनमा त्याहाको माटोमा निर्भर रहने वैज्ञानीकहरुले वताएका छन् । माटोको संरचना अनि माटोको तापमान अनुसार सिचाई गर्न वैज्ञानीकहरुको सुझाव छ । आवश्यकता भन्दा वढि सिचाई भए आलुको फल कुहीएर नष्ट हुने डर हुने भएकोले आलुको सिचाई गर्दा विषेश ध्यान दिनुपर्ने हुन्छ ।\n" +
                        "\n" +
                        "५) आलु खन्ने:\n" +
                        "\n" +
                        "आलु १० हप्ता अर्थात साढे दुई महिनामा तयार हुन्छ । आलुलाई खन्दा सुख्खा दिनमा खन्ने गर्नुपर्छ । खन्ने समयमा विषेश ध्यान दिनुपर्ने हुन्छ । फलमा चोट लागे आलुनै विग्रने र कुहीने डर वढि हुन्छ । आलुलाई खनिसकेपछि पानीमा धुनु सवैभन्दा हानिकारक हुन्छ त्यसैले नधोई राख्नुपर्ने हुन्छ ।\n" +
                        "\n" +
                        "६) आलु खेतिमा आउने समस्याहरु:\n" +
                        "\n" +
                        "आलु फलाउन जति सजिलो छ त्यस भन्दा धेरै गाहे यसलाई वचाई राख्न हुन्छ । आलुको तापक्रम मिलाउन नसके कुहिने डर वढि हुन्छ । यसमा रहेको माटो र चिसोपनालाई खनिसकेपछि विषेश व्यवस्थापन गर्न सकिएन भने कुहिन्छ । यतिमात्र हैन आलुमा विषेश प्रकारको किरा लाग्ने गर्दछ जसले भित्र भित्रै खाएर कालो रेखा वनाईदिन्छ जसले आलु खान योग्य हुँदैन । आलुको विउ छनौटमा पनि हामिले विषेश ध्यान दिन सकेनौ भने पनि यसको उत्पादन राम्रो लिन सकिँदैन । आलुमा लाग्ने विभिन्न रोगहरु हुन्छन त्यस्ता रोगबाट वचाउनका लागि नजिकैको जेटिय, सेवाकेन्द्रका कर्मचारी वा जिल्ला कृषि विकास कार्यालयमा सम्पर्क गर्ने गर्नु पर्छ । उत्पदान भएको आलुको वजारको कमी भईरहेको छ भने मूल्यमा अस्थिरता, स्थानिय वजारको अभावजस्ता समस्या आलु किसानहरुले व्यहोरी रहेका छन् ।\n" +
                        "\n" +
                        "आलुको सुरक्षा:\n" +
                        "\n" +
                        "आलु खनिसकेपछि भण्डार गर्ने स्थानमा लैजानुभन्दा पहिले घाम नपर्ने सुख्खा स्थामा राख्ने । यसपछि इमी डाक्लोरेपिड १७ दशमलव ८ लाई ५० एल पानीमा मिलाई आलुको दानमा छर्कने । यस्तो प्रक्रिया प्रत्येक दुइृ दुई महिनामा गर्नुपर्ने वैज्ञानीहरुकले जनाएका छन् ।"
                );

    insert_Suggestion(db,"Cauliflower","४० – ४५ डोको कम्पोस्ट मल अर्थात १००० – १५०० के.जी. प्रति कठा । रासायनिक मलको हकमा माटोको उर्वराशक्तिको अधारमा केहि फरक भए पनि साधारण सिफारिस अनुसार ३०५ के.जी. नाइट्रोजन, २.५ के.जी. फरसफोरस र १.६ के.जी पोटास अर्थात ५ के.जी. डि.ए.पी., यूरिया ५.७ के.जी. र म्यूरेट अफ पोटास २.६ के.जी. आवश्यक पर्दछ । डि.ए.पी., म्यूरटे अफपोटास को पुरैमात्रा तथा यूरियाको आधार मात्रा कम्पोस्ट मल संगै जग्गा तयारी गर्न बेलामा बेसल डोजका रुपमा दिनु पर्दछ भने बाँकी आधा यूरियालाई दुई स्पिलिट डोजमा प्रयोग गर्नु पर्दछ । पहिलो टपडे सिग वाली लगाएको २०–२५ दिन पछि (सारेको) र दोश्रोपल्ट ४०–४५ दिन पछि ।"
            ,""
    ,"माटो\n" +
                    "काउली, बन्दाको उत्पादन विभिन्न किसिमको माटोमा गरिएता पनि केहि गहिरो दोमट माटो भएको ठाँउ राम्रो मानिन्छ । माटो उर्वराशक्तियुक्त प्रांगरिक पदार्थ प्रशस्त भएको र पानी निकास सजिलै हुनुपर्दछ बढी अम्लीय माटोमा यी वालीहरु राम्रो फस्टाउदैनन । तसर्थ राम्रो उत्पादनको लागि माटोको अन्लीय पना ५.५ – ६.५ सम्म भएमा विरुवाले आवश्यक पोषकतत्व सजिलै माटोबाट लिन सक्छन् र उत्पादकत्व समेत बढदछ । बन्दा बालीको लागि अगौटे वालीको उत्पादनमा वलौरे दुमर माटो राम्रो भएता पनि बढी उत्पादन लिनका लागि पांगो दुमर माटो राम्रो हुन्छ ।\n" +
                    "\n" +
                    "बिउदर\n" +
                    "अगौटे जात – २५ ग्राम प्रति कठा\n" +
                    "१० ग्राम प्रति कठा ( हाइव्रिड )\n" +
                    "मध्य मौसमी र पछौटे जात – १५ ग्राम प्रति कठा\n" +
                    "१० ग्राम प्रति कठा ( हाइव्रिड )\n" +
                    "\n" +
                    "गोडमेल/सिचाई\n" +
                    "बिरुवा सारिसकेपछि ४–५ दिनको फरकमा माटोको चिस्यान हेरि पानी लगाउनुपर्छ । १०–१५ दिन पछि बिरुवा वरिपरि गोडी झार निकालि दिनु पर्दछ ।\n" +
                    "\n" +
                    "काउली समुह तरकारी बालीका रोगहरू :\n" +
                    "१) क्लब रुट (Club root):\n" +
                    "ढुसीको जीवाणु Plasmodiophora brassicae ले गर्दा यो रोग हुन्छ । जमिन माथिको भागहरूमा बीना कुनै सङ्केत रोग बिरुवा भित्र फैलिसकेको हुन्छ । पहिलो लक्षण घाममा पातहरू ओइलिने र बिहान बेलुका ठाडो हुने हुन्छ । संक्रमित जरा सुनिन्छ जरामा ठुल ठुला\n" +
                    "गाँठा बनेको हुन्छ जसलाई Club भनिन्छ ।\n" +
                    "\n" +
                    "रोगको रोकथाम:\n" +
                    "सुरक्षात्मक व्यवस्था गर्नमा बढी ध्यान केन्द्रीत गर्नुपर्छ । काउली समूहका परिवारको झारपातलाई मास्नु पर्छ । रोग मुक्त खेतबारी प्रयोग गर्नुपर्छ । संक्रमण मुक्त माटोमा नर्सरी गरी बेर्ना उत्पादन गर्नुपर्छ । लामो अवधिको बाली चक्र अपनाउन पर्छ । तर बाली चक्रमा काउली समूहको बाली पर्नु हुँदैन ।\n" +
                    "PH को मान ७.२ गर्नुपर्छ । यसको लागी Hydrated lime प्रयोग गर्नुपर्छ । माटो जँचाई सिफारिस अनुसारको परिमाणमा चूना हाल्नु पर्छ ।\n" +
                    "बेनलेटको ०.५% झोलमा बेर्नालाई २० मिनेटसम्म डुबाई रोप्नु पर्छ । त्यस पछि बिरुवालाई १० ग्राम प्रति ली. पानीमा बेन्लेटको झोल बनाइ माटो भिज्ने गरी छर्नुपर्छ ।\n" +
                    "नेभेजिन ०.३% डि.पि. २००–३०० के.जी. /हे.जमिन को माटोमा मिसाई बेर्ना सार्नु पर्छ ।\n" +
                    "५–८ ग्राम प्रतिबोट हाल्न पनि सकिन्छ । नर्सरीको लागी ३ के.जी. नेभेजिन प्रति १० घन मिटर माटोमा हाली उपचार गरी बीउ छर्नुपर्छ ।\n" +
                    "\n" +
                    "(२) डाउनी मिल्ड्यू (Downy mildew):\n" +
                    "यो रोग Peronospora parasitica ढुसीबाट हुन्छ । ढुसिको वृद्धि पातको तल्लो भागमा आउँछ । बहुवर्षीय वैकल्पीक आहारामा बांची रहन्छ र संक्रमणित अवशेषमा पनि रहन्छ ।\n" +
                    "यो बीउबाट पनि सर्छ । पातको तल्लो सतहमा प्याजी खैरो दागहरू देखिन्छ । पातको माथिल्लो सतहमा खैरोदेखि पहेँलो घाउको ठाउँमा देखिन्छ ।\n" +
                    "\n" +
                    "रोगको रोकथाम:\n" +
                    "\n" +
                    "(१) खेतको सर सफाइ\n" +
                    "(२) स्वस्थ बीउ प्रयोग गर्नुपर्छ ।\n" +
                    "(३) यस परिवारको झारपात मास्नु पर्छ ।\n" +
                    "(४) ब्रासिकेसी परिवारको बाली नपर्ने गरी ३–४ वर्षे बाली चक्र अपनाउने ।\n" +
                    "(५) बीउ उपचार वेभिष्टिनले गर्ने ।\n" +
                    "(६) १० दिनको फरकमा ०.२% को मेनकोजेवको झोल बालीमा छर्ने ।\n" +
                    "\n" +
                    "(३) ह्वाईट रस्ट/ह्वाईट बिल्सटर (White rust/White blisters):\n" +
                    "पातमा सेतो दागहरू देखिन्छ । पातको तल्लो भागमा बढी हुन्छ । नयाँ डाँठ र डुकुमा आक्रमण गरे पछि विभिन्न विकृतीहरू देखिन्छ । डुकुको हाँगाहरूमा सानो सेतो फोकाहरू देखिन्छ । डुकुको हाँगाहरू सुनिन्छ र फूलहरूले विकृत रुप लिन्छ । यो Albugo candida ढुसीबाट हुन्छ ।\n" +
                    "\n" +
                    "रोगको व्यवस्थापन:\n" +
                    "– खेतको सर सफाइ ।\n" +
                    "– बालीको संक्रमित अवशेषहरू नष्ट गर्ने ।\n" +
                    "– १% को बार्डोमिक्सचर प्रयोग गर्ने ।\n" +
                    "\n" +
                    "(४) ब्ल्याक–लेग (Black leg)\n" +
                    "यो रोग Phoma lingam ढुसीद्वारा हुन्छ । नर्सरीदेखि नै बिरुवा संक्रमित हुन्छ साथै बालीको वृद्धि विकासको जुनसुकै अवस्थामा आक्रमण गर्न सक्छ । बिरुवाको फेँदमा माटो नजिक घाउ लाग्छ र यो घाउ फेँदको चारै तीर फैलिन्छ । माटोको नजिक डाँठको घाउ जरा सम्म फैलिन्छ । पातमा र डाँठमा कालो थोप्लाहरू हुन्छ ।\n" +
                    "\n" +
                    "रोगको रोकथाम:\n" +
                    "बीउबाट सर्ने हुँदा Hot water treatment गरी बीउ रोप्नुपर्छ । तर पुरानो बीउलाई भने पानीमा उपचार गर्नु हुँदैन । बीउको उमार शक्ति क्षीण भए कम उम्रिन्छ । बीउ उत्पादकहरूले आफ्नो उत्पादित बीउ ताजा अवस्थाको समयमा तातो पानीमा उपचार गर्नुपर्छ ।\n" +
                    "\n" +
                    "(५) अल्टरनेरिया लिफ स्पट (Alternaria leaf spot)\n" +
                    "यो रोग Alternaria brassicicola ढुसीद्वारा हुन्छ । बीउबाट र संक्रमित बिरुवाको अवशेषबाट पनि फैलिन्छ । कालो स–साना थोप्लाहरू पातमा देखिन्छ र पछि चक्का जस्तो हुन्छ । डाँठ र कोसामा पनि आक्रमण गर्छ ।\n" +
                    "\n" +
                    "रोगको रोकथाम:\n" +
                    "– संक्रमित बालीको अवशेष नष्ट गर्ने ।\n" +
                    "– बाली चक्र अपनाउने ।\n" +
                    "– तातोपानीबाट उपचार गर्नुपर्छ ।\n" +
                    "– Copper oxychloride ०.५–०.७५% झोल बनाइ बिरुवाको शुरुको अवस्थामा प्रयोग\n" +
                    "गर्नुपर्छ ।\n" +
                    "\n" +
                    "(६) ब्ल्याक रट (Black rot)\n" +
                    "शितोष्ण एवं उपोष्ण क्षेत्र जहाँ वर्षा र शित बढी हुन्छ र तापक्रम १५–२२ डी.से. हुने क्षेत्रमा यो रोगले गम्भीर समस्या उत्पन्न गर्छ । यो रोग Xanthomonas compestris साकाणु (Bacteria) द्वारा हुन्छ । सानो बेर्ना देखि बिरुवाको वृद्धि विकासको कुनै पनि अवस्थामा आक्रमण गर्न सक्छ । पातको किनाराबाट सक्रमण शुरु भइ भित्र पट्टी जान्छ । किनाराको पात पहेँलो हुन्छ र अङ्ग्रजीको भि (V) को आकार लिन्छ ।\n" +
                    "\n" +
                    "रोगको रोकथाम:\n" +
                    "– बीउ उत्पादकले बीउ उत्पादन लगतै ५० डी.से.को तातो पानीमा आधा घण्टासम्म बीउलाई डुबाएर राख्ने ।\n" +
                    "– २–३ वर्षे बाली चक्र अपनाउने ।\n" +
                    "– बेर्ना उत्पादन गर्न बीउको उपचार Antibiotics ले गरेको हुनुपर्छ ।\n" +
                    "– Streptocycline ५० पी.पी. एम. झोल बेर्ना सारे केही दिन मै छर्ने र अर्को पटक कोभी बन्न शुरु भए पछि छर्ने ।\n" +
                    "– १२.५ के.जी. स्टेबल बिलिचिङ्ग पाउडर (Stable bleaching powder) को झोलले खेतको माटोलाई ड्रेंच (Drench) गर्ने । यसले सफ्ट           रटलाई पनि नियन्त्रण गर्छ\n" +
                    "\n" +
                    "(७) ब्याक्टेरियल सफ्ट रट (Bacterial soft rot)\n" +
                    "यो रोग Erwinia cartovora साकाणुद्वारा हुन्छ । बिरुवामा चोट–पटक लागी घाउ भएको ठाउँबाट पस्छ । बढी आद्रतामा तिब्र गतीले फैलिन्छ । संक्रमित बिरुवा सड्न थाल्छ । डाँठमा लागेपछि यसले स्टम्प रट (Stump rot) भई डाँठलाई कुहाउँछ ।\n" +
                    "यसको रोकथाम/व्यवस्थापन Black rot जस्तै गर्नुपर्छ ।\n" +
                    "\n" +
                    "(८) टर्निप मोज्याक (Turnip Mosaic virus)\n" +
                    "यसको सम्बाहक लाही हो । पात गाढा हरियो र हल्का हरियो रङ्गको छिरविरे दागहरू देखिन्छ र गाढा हरियो भागहरू माथि उठेको देखिन्छ (Puckering leaves) ।\n" +
                    "\n" +
                    "रोगको रोकथाम:\n" +
                    "– संक्रमित बिरुवा उखेली नष्ट गर्ने ।\n" +
                    "– लाही कीरालाई नियन्त्रण गर्ने ।\n" +
                    "\n" +
                    "काउली बालीमा लाग्ने विनाशकारी कीराहरू:\n" +
                    "(१) बन्दाको पुतली (Cabbage butterfly)\n" +
                    "बन्दाको पुतली (Pieris brasicae nepalensis) ले बन्दा, काउली, ब्रोकाउली, ग्याठकोभी, रायो, मूला आदिलाई क्षति गर्छ । वयस्क कीरा सेतो, मध्यम आकार, अगाडीको पखेटाको भागमा कालो थोप्लाहरू हुन्छ । लार्भाको शरीर भरी रौं र काला थोप्ला हुन्छ । शरिरको माथी भागमा तीनवटा धर्साहरू हुन्छ । पातहरू र कमलो डाँठ खाई क्षति गर्छ ।\n" +
                    "\n" +
                    "रोकथाम:\n" +
                    "– हातले फूल, लार्भा र प्यूपाहरू टिपी नष्ट गर्ने ।\n" +
                    "– इट्रेपिड किटनाशक १.५–२ एम.एल. प्रतिलिटर पानीमा १ एम.एल. स्टीकर हाली छर्ने ।\n" +
                    "– वा, साइपरमेथ्रिन (२० र्इं.सी.) १ एम.एल. प्रति लीटर पानीमा झोल बनाइ छर्ने ।\n" +
                    "\n" +
                    "(२) डायमण्ड व्याक पुतली (Diamond back moth) :- ईट बुट्टे पुतली\n" +
                    "डायमण्ड व्याक मोथ (Plutella xylostellea) ले काउलीका पातहरू प्वाल गरी कलिलो अवस्थादेखि बिरुवाहरूलाई खाई क्षति गर्छ । वयस्क पुतली खैरो रङ्ग र ३ वटा त्रिकोणाकार दागहरू अगाडीको पखेटाको पछाडी तीर हुन्छन् । लार्भा हरियो, दुवै छेउ सानो र छोए पछि गोलो आकारमा बेरिन्छ ।\n" +
                    "\n" +
                    "रोकथाम:\n" +
                    "काउली समूहका तरकारी बालीहरूको अवशेष नष्ट गर्ने । बेर्ना सारेको २० दिनदेखि निम मार्क ३–५ एम.एल/ली. पानीमा झोल बनाइ छर्ने र १५–१५ दिनको फरकमा पुनः छरी रहनु पर्छ । ब्यासिलस थुरेन्जेन्सिस (बि.टि.) Bacillus thuringiensis नामक साकाणु युक्त पदार्थ ०.५ किलोग्राम/हे.को दरले प्रयोग गर्ने । किटनाशक रसायनको प्रयोग :फेनवेलरेट २ ०.७५–१.०/ केलडान ५० ए.पी. २ २.०/न्यूकिल्न १० ई.सी. १.५/डुनेट १२.५ एल २ ६–९ एम.एल. वा ग्राम प्रति लीटर पानीमा १ एम.एल. स्टीकर मिसाई छर्नुपर्छ । बेर्ना सारेको १० दिन पछि २५ के.जी. केलडान (४ जी.) माटोमा छर्नुपर्छ ।\n" +
                    "(३) उफ्रने खप्टे (Flea beetle)\n" +
                    "\n" +
                    "उफ्रने खपटे (Phyllotreta Cruciferae) ले कोल क्रप (Cole crop), जरे बाली (गाँजर बाहेक)\n" +
                    "जस्तै रायो, तोरी आदि बालीको पातहरू वयस्क कीराले दुलो पारी खान्छ र पातमा दुलो-दुलै देखिन्छ । वयस्क कीरा कालो टल्कने हुन्छ र उपियाँ जस्तो फड्कन्छ । लार्भाका रङ्ग सेतो र शरीर लाम्चो एवं पातलो हुन्छ ।\n" +
                    "\n" +
                    "रोकथाम:\n" +
                    "\n" +
                    "-निममार छर्ने ।\n" +
                    "\n" +
                    "(४) तोरीको करौंते झिङ्गा (Mustard sawfly)\n" +
                    "तोरीको करौंते झिङ्गा (Athalia lugens) ले काउली लगायत कोल क्रप (Cole crop) आदिलाई क्षति पुर्याउँछ । वयस्क झिङ्गा घर झिँगा जस्तै हुन्छ । टाउको कालो शरीरको रङ्ग पहेँलो र यसको शरीरको पछाडी भागमा करौंती जस्तो कालो धर्साहरू शरीर माथी हुन्छ, आठवटा खुट्टा हुन्छन् । छोए पछि बेरिन्छ । लार्भाले पातहरू खाई क्षति गर्छ ।\n" +
                    "\n" +
                    "रोकथाम :\n" +
                    "– बन्दाको पुतलीलाई गरिने रोकथामका उपाय यसको लागी पनि अपनाउने ।\n" +
                    "\n" +
                    "(५) लाहीहरू (Aphids)\n" +
                    "\n" +
                    "तोरीको लाही, काउलीको लाही आदि (Lipaphis erysini, Brevicioryne brassicae आदि) ले कोलक्रप तरकारी बालीबाट रस चुसेर क्षति गर्छ । वयस्कहरू पखेटा भएका वा नभएका दुवै हुन्छन् । नली जस्तो दुईबटा अङ्गहरू यसको शरीरको पछिल्लो भागमा हुन्छन् । जसलाई cornicles भनिन्छ । यी बाली अनुसार विभिन्न प्रजातीका हुन्छन् । बिरुवाबाट रस चुसे पछि बिरुवा पहेँलो हुन्छ ।\n" +
                    "\n" +
                    "रोकथाम:\n" +
                    "इमिडाक्लोप्रिड (Imidachloprid ०.७. एस.एल.) २ ०.२–०.२५ एम.एल प्रति लीटर पानीमा १ एम.एल. स्टीकर मिसाई छर्ने । तीन सप्ताह पछि डायमण्ड व्याक मोथको लागी प्रयोग गरिने किटनाशक रसायनहरू प्रयोग गर्न सकिन्छ । निममार छर्ने ।\n" +
                    "\n" +
                    "पौष्टिकतत्वको कमीबाट हुने विकृतिहरू:\n" +
                    "(१) कोभी कुहिने (Curd rot):\n" +
                    "\n" +
                    "प्रायः वोरनको कमीले काउलीमा देखिन्छ । तराई र पहाड सबै ठाउँमा बोरनको कमी देखिन्छ । कोभीमा पानीले भिजेको जस्तो देखिन्छ ।\n" +
                    "कोभीका रङ्ग खैरो हुन थाल्छ । अत्यधिक कमीमा बिरुवाको डाँठ खोक्रो हुन्छ । अझ B (बोरोन) कमीमा कोभी गुलाफी रङ्गको हुन्छ । बिरुवाको शुरुको अवस्थामा नयाँ पात पहेँलो हुन्छ र टुप्पा खैरो रङ्गको हुन्छ । द्य (वोरन) तत्वको कमीबाट प्रभावित कोभीको स्वाद फिका हुन्छ । बोरेक्स करिब ३०–४० के.जी.÷हे. माटोमा हाल्नु पर्छ । बोरोनको गम्भीर कमीमा ०.२५–०.५% को बोरेक्स झोल छर्ने । सामान्य अवस्थामा बिरुवाको शुरु देखि शुक्ष्मतत्वको मिश्रण २ ग्राम/ली. पानीमा झोल बनाइ तीन पटक छर्ने ।\n" +
                    "\n" +
                    "(२) Whiptail (व्हीपटेल):\n" +
                    "\n" +
                    "मोलिव्डेनम (M0) तत्वको कमीले गर्दा कलिलो बिरुवाको नयाँ पातहरूमा हरियो रङ्ग कम हुँदै जान्छ र पातको किनारा सेतो हुन्छ । समस्या गम्भीर भयो भने पात कपको आकार जस्तो हुन्छ, ओइलिन्छ र मर्छ । छिपि सकेको बिरुवामा पात आकार चौडाइमा कम हुँदै जान्छ र बीच मुख्य नसा मात्र देखिन्छ जसलाई Whiptail भनिन्छ । २५० पी.पी. एम. को सोडिय मोलिब्डेट झोल छर्नाले यो निको हुन्छ । नर्सरी देखि\n" +
                    "नै शुक्ष्म तत्वको मिश्रण छर्दा यो समस्या आउँदैन ।\n" +
                    "\n" +
                    "अन्य विकृतीहरू:\n" +
                    "(१) सानो कोपी लाग्नु (Buttoning):\n" +
                    "\n" +
                    "यसका केही कारणहरू बढी उमेरका बेर्ना, नाइट्रोजन तत्वको कमी तथा अनुपयुक्त बाली लगाउने समय आदि हुन् । तर मुख्य कारण काउली सानो कोभी लाग्नुमा वानस्पतिक वृद्धि अवरुद्ध हुनु र तापक्रम बढी हुनु हो ।\n" +
                    "\n" +
                    "(२) कोभी खुकुलो र कोपिला देखिनु (Raicyness/Granulation):\n" +
                    "उपयुक्त (Optimum) तापक्रम भन्दा अधिक र कम तापक्रमले काउली बालीको आवश्यकता पुरा नगरी गोभी फक्रेको हुन्छ र फूलको कोपीला खुकुल्लो देखिन्छ ।\n" +
                    "\n" +
                    "(३) कोभी नलाग्नु (Blind):\n" +
                    "\n" +
                    "कीराले बिरुवा मुन्टो खाई दिँदा वा खेतमा काम गर्दा मुन्टो चुडिए पछि त्यस्तो बिरुवामा कोभी लाग्दैन र यस अवस्थालाई व्लाइण्ड (Blind) भनिन्छ ।\n" +
                    "\n"
                    );
            insert_Suggestion(db,"Corn","मलखादको मात्रा माटोको उर्वरापन, मकैको जात, सिंचाई सुविधा, वाली चक, रोप्ने समय आदिमा भर पर्ने भएता एक हेक्टर जमिनमा करीब १५ देखि २० टन राम्रो संग कुहिएको गोबर मल तथा कम्पोष्ट मल प्रयोग गर्नु उपयूक्त हुन्छ । मल राखिसके पछि तुरुन्त जोतेर त्यसलाई माटोमा मिलाउनु पर्दछ । रासायनिक मलको सिफारिस मात्रा ल्एप् १२० : ६०: ४०/हे. (२१० के. जि. यूरिया, १३० के. जि. डि.ए.पि., ६७ के. जि. पोटास) का दरले प्रयोग गर्नु पर्दछ । यूरियाको आधा भाग मात्र जमिन तयारी गर्दा प्रयोग गरी वाकिँ भाग टप ड्रेसका लागि छुट्टाएर राख्नु पर्दछ भने डि.ए.पी र पोटासको पुरै भाग मकै रोप्ने बेलामा माटोमा मिलाउनु पर्छ । वाकिँ युरीयाको आधा (पहिलो टप ड्रेस) मकै घँुडाघँुडा हुने बेलामा र बाँकि भाग (दोस्रो टप ड्रेस) धान चमर आउनु भन्दा अगाडि प्रयोग गर्नु पर्दछ ।",
                    "मकै भाँचिसके पछि राम्रो संग सुकाएर दानाको चिस्यान १२ प्रतिशत भन्दा कम भएपछि झुत्ता बनाएर राख्ने वा दाना छोडाएर सफा भकारी, टिनको बाकस तथा बोरामा पनि राख्न सकिन्छ । यसरी मकै भन्डारण गर्दा भन्डारणमा लाग्ने किरा हरु बाट बचाउन बिभिन्न किटनासक बनस्पतिहरु जस्तै ः निमको राम्रो संग पाकेको फलहरु सुकाएर पिसेर धुलो बनाई १० ग्राम प्रति के. जी. मकैका दरले प्रयोग गर्ने अथवा टिमुर पिसेर धुलो बनाई २० ग्राम प्रती के. जी. मकैका दरले प्रयोग गर्ने अथवा बोझोको जरालाई सफा गरी काटेर सुकाउने र त्यसलाई पिसेर बनाएको धुलो प्रती के. जी. मकैमा २० ग्राम दरले प्रयोग गर्दा मकैलाई घुन पुत्लाबाट बचाउन सकीन्छ । यसका अतिरिक्त प्रति टन २ चक्कि सेल्फस राखेर अथवा मकैलाई सुपरग्रेन ब्यागमा राखी सुरक्षित भण्डारण गर्न सकिन्छ ।",
                    "पृष्टभुमी\n" +
                            "नेपालको दोस्रो महत्वपुर्ण खाधान्नवालीको रुपमा स्थापित मकै वाली नेपालको पहाडी क्षेत्रको प्रमुख खाधान्न हुनुका अतिरिक्त घासँ, दाउरा तथा दानाको एउटा प्रमुख श्रोत पनि हो । खाधान्न उत्पादनमा करीव २३.२९ प्रतिशत योगदान पुयाएको मकै वालीको खेती मधेश र भित्री मधेश, मध्य पहाड तथा उच्च पहाडमा गरिने भएता पनि सवैभन्दा वढि खेति (करिव ७०.३ % क्षेत्रफल) मध्यपहाडमा पर्दछ । नेपालमा सन् २०१३/१४ मा ८,४९, ६३५ हेक्टर क्षेत्रफलमा खेती गरी १९,९९,०१० मे. टन मकै उत्पादन भएको थियो, जसअनुसार मकैको उत्पादकत्व २.३५ टन/ हे. रहेको छ (MoAD, 2014). । पहाडी क्षेत्रमा खाधान्न तथा तराईमा वढ्दो कुखुरापालन तथा पशुदानाको रुपमा प्रयोग हुनाले माग अत्यधिक मात्रामा वढ्दै जानुले उत्पादन र उत्पादकत्वमा वृदि गर्दै माग अनुरुपको पुर्ति पुयाउनु पर्ने ठुलो चुनौती खडा भएको छ । उन्नत मकै खेति प्रविधिका लागि निम्न वुदाहरुमा ध्यान दिनु आवश्यक हुन्छ ।\n" +
                            "\n" +
                            "बिउको छनौट\n" +
                            "अन्य खेती जस्तै मकै खेति गर्दा पनि कस्तो हावा पानी भएको ठाँउमा खेति गरिदैछ सोहि ठाँउको हावा पानी अनुसार सिफारिस गरिएको मकैको जात लगाउँदा बढी उत्पादन लिन सकिन्छ । जस्तैः उच्च पहाड (समुन्द्रि सतहदेखि १८०० देखि २५०० मिटर उचाई ) का लागि गणेश–१, गणेश–२ मध्य पहाड (समुन्द्रि सतहदेखि ८०० देखि १८०० मिटर उचाई) का लागि खुमल पहेलो, मनकामना–१, मनकामना –३, देउती, शितला, मनकामना –४, मनकामना –५, मनकामना –६, पोषिलो मकै–१, अरुण –१ र तराई तथा भित्रि मधेश (समुन्द्रि सतहदेखि ८०० मिटर देखि तलको उचाई) का लागि रामपुर कम्पोजिट, अरुण –२, अरुण –४, अरुण –६, रामपुर हाईब्रिड –२ आदि सिफारिस जातहरु हुन । मकैको बिउ छनौट गर्दा जातिय शुद्धता, भौतिक शुद्धता, उमारशक्ति, चिस्यान, चमकपन तथा जिवितपन भएको गुणस्तरिय बिउमात्र छनौट गर्नु पर्दछ ।\n" +
                            "यसका अतिरिक्त मकै रोप्दा मकैको बिउ भिजाएर रोपेमा चिस्यान कम भए पनि बिउ छिटो उम्रने, विरुवा सुख्खा अवस्था सहन सक्ने, एकरुपको विरुवा हुने  एकै समयमा पाक्नुका साथै आबश्यक बोट संख्या कायम भइ उत्पादनमा बृद्धि हुन्छ । यस प्रबिधिमा मकै रोप्नु भन्दा अगाडी १६–१८ घन्टा बिउलाई भिजाउनु पर्दछ र १५–३० मिनेट छायाँ पर्ने ठाउँमा गुन्द्री, नाङ्लो वा मान्द्रोमा फिजाएर पानी तर्काई सोहि दिन नै रोप्नु पर्दछ । बिउ भिजाएर रोप्दा किराले खाएका अस्वस्थ बिउहरु पानीमा तैरिएर छुट्टिने हुँदा राम्रो बिउ मात्र छनौट गर्न सजिलो हुन्छ । यसरी विउ भिजाउदा विभिन्न कुराहरुमा ध्यान दिनुआवश्यक हुन्छ जस्तै भिजाएको बीउलाई घाममा सुकाउनु हुँदैन, भिजाएको र नभिजाएको बीउ मिसाएर सँगै रोप्नु हुँदैन, जमीन एकदम सुख्खा छ भने बीउ भिजाएर छर्नु हुँदैन, सितलमा फिजाउनु पर्दछ जसले गर्दा बीउको सतहको पानी सुकी रोप्न सजिलो होस् ।\n" +
                            "\n" +
                            "स्थल छनौट तथा जमिन तयारी\n" +
                            "मकै खेतिका लागि पानी नजम्ने  तथा निकासको उचित व्यवस्था भएको, पि. एच. ५.५ देखि ७.५ सम्म भएकोे मलिलो दोमट माटो भएको जमिन छनौट गर्नु पर्दछ ।\n" +
                            "मकै लगाउने खेत तथा बारीमा २/३ पटक जोतेर डल्ला फुटाइ माटो बुर्बुराउँदो बनाउनु पर्दछ । माटोमा चिस्यानको मात्रा कम भएमा जोत्नु भन्दा अगाडी सिंचाई गरेर जोतेमा माटो बुर्बुराउँदो हुन्छ । माटोको पि.एच. तथा बुनोट अनुसार माटो अम्लीय भएमा आवश्यक मात्रामा कृषि चुनको पनि प्रयोग गर्न सकिन्छ ।\n" +
                            "\n" +
                            "हावापानी तथा लगाउने समय\n" +
                            "मकैको लागि गरम हावापानी उपयूक्त मानिन्छ, यसलाई उम्रनकोे लगि करिव २० डि.से. तापक्रम तथा वृद्घिको समयमा औसत २१–२७ डिग्री से. तापक्रम उपयुक्त मानिन्छ । धान चमरा निस्कने समयको तापक्रम १०० C भन्दा कम र ४० ०C भन्दा वढि हुदाँ दाना कम लाग्ने समस्या आउने हुदाँ हावापानी मिलाएर खेति गर्नु आवश्यक हुन्छ ।\n" +
                            "मौसम र वर्षाको अनुकुलता हेरी वर्षे खेतिका लागि समुद्री सतहदेखी २१०० मि. वा सो भन्दा अग्लो लेकमा फाल्गुन देखि यथासम्भव चाँडो र समुद्री सतहदेखी १२००–२००० मि. उचाईको क्षेत्रहरुमा चैत्र १५ देखी वैशाखको अन्त्य सम्ममा र तल्लो भेगमा पानी परेपछि मकै लगाउदा उपयूक्त हुन्छ भने हिउदे मकै लगाउदा पहाडमा भाद्र र भित्री मधेश तथा तराईमा भाद्र देखी कार्तिक सम्ममा लगाउदा उपयूक्त हुन्छ । यसै गरी वसन्ते मकै लगाउदा पहाडमा माघ देखी फाल्गुन र भित्री मधेश तथा तराईमा फाल्गुन देखी चैत्र सम्ममा लगाउदा उपयुक्त हुन्छ ।\n" +
                            "\n" +
                            "मकै रोप्ने तरिका तथा बिउ दर\n" +
                            "मकै रोप्दा लाइनको दुरीे ७५ से.मि. तथा बोटको दुरी २५ से.मि. कायम गरेर रोप्नु पर्दछ । लाईन मिलाएर मकै रोप्दा गोडमेल गर्न सजिलो हुनुका साथै बोटको संख्या पनि बढी हुन्छ । यसरी मकै रोप्दा प्रति हे. प्रति हेक्टर ५३००० भन्दा बढी मकै वोट संख्या.कायम हुने गर्दछ । यसरी मकै रोप्दा ८५ % उमारशक्ति भएको उन्नत विउ प्रति हेक्टर २० देखि २५ के. जि. सम्म बिउ आवश्यक पर्दछ । यसरी लाइनमा मकै रोप्दा सामान्यतया कृषक हरुले रोप्ने संख्या भन्दा करिब २० प्रतिशत बढी बोटहरु कायम हुन्छ । मकैको बोटको उचाईको आधारमा होचो बोट हुने तथा चाडो पाक्ने मकैको जातहरुलाई लाइनको दुरी ६० से. मि. तथा बोटको दुरी २० से. मि. कायम गरेर पनि लगाउन सकिन्छ ।"+
                            "छापो राख्ने\n" +
                            "छापो राखेर खेति गर्दा निम्नानुसारका फाईदाहरु हुने भएकाले सम्भव भए सम्म मकै रोपे पछि रोपेको ठाँउको वरपर छापो राख्नु उपयुक्त हुन्छ ।\n" +
                            "(क) झारपातको प्रकोप कम हुने हुँदा बालीको उत्पादनमा बृद्धि हुन्छ ।\n" +
                            "(ख) माटोमा चिस्यानको मात्रा कायम हुन्छ सिंचाइको सुबिधा नभएको ठाँउमा त यसको महत्व अझ बढी हुन्छ ।\n" +
                            "(ग) छापो राखिएको ढोंड, पोस्कर, पात पतिङ्गरहरु कुहिएर मल बनि माटोको उर्बराशक्तिमा बृद्धि हुन्छ ।\n" +
                            "(घ) भू–क्षयको केहि हद सम्म नियन्त्रण हुन्छ ।\n" +
                            "\n" +
                            "गोडमेल तथा सिंचाई\n" +
                            "पहिलो गोडाइ मकै उम्रेको ३ देखि ४ हप्ता भित्र र दोस्रो गोडाइ पहिलो गोडाइ गरेको २ देखि ३ हप्ता पछि गर्नु पर्दछ । दोस्रो गोडाइमा मकै घुडा  अग्लो भएको हुन्छ र यसवेला उकेरा दिनु आवश्यक हुन्छ । सिंचाइको सुबिधा भएमा पहिलो सिंचाइ पहिलो गोडाइ पछि, दोस्रो सिंचाइ धानचमर आउने बेला र तेस्रो सिंचाइ मकैको दाना पोटिलो हुने बेलामा गर्नु पर्दछ ।\n" +
                            "\n" +
                            "रोग तथा किरा व्यबस्थापन\n" +
                            "नेपालमा मकै बालीमा मुख्य गरि कालो पोके, सेते रोग (डाउनी मिल्डयू), खैरोथोप्ले रोग (ब्राउन स्पट), ध्वासे थेग्ले रोग (ग्रे लिफ स्पट), मकैको पात र डाँठमा लाग्ने धब्बे रोग (बेन्डेड लिफ एन्ड शिथ ब्लाईट), पातमा लाग्ने डढुवा (लीफ ब्लाईट) घोगा कुहिने (ईयर रट) ) डाँठ कुहिने (स्टक रट) आदि रोगहरु समस्याका रुपमा देखा परेको पाईएको छ । यी रोगहरुको रोकथाम निम्नानुसारका उपायहरु अपनाई गर्न सकिन्छ ।\n" +
                            "\n" +
                            "(क) रोग प्रतिरोधि जातहरु लगाउने जस्तै डढुवा रोग अवरोधक मनकामना – ३, गणेश – १ सेतो धर्से रोग सहन सक्ने रामपुर कम्पोजिट, मनकामना–३, गणेश–१, खैरो थोप्ले रोग अवरोधक मनकामना – ३, मनकामना – ४, मनकामना – ५, मनकामना – ६ ।\n" +
                            "\n" +
                            "ख) घोगा र दाना कुहिने रोग वाट मकैलाई वचाउन खोष्टा टुप्पासम्म कस्सिएको र पुरा ढाक्ने खालका जात जस्तै गणेश–२, रामपुर कम्पोजिट आदि लगाउने ।\n" +
                            "\n" +
                            "(ख) रोगी बोटहरु उखेलेर फाल्ने तथा रोगी बोटका अवशेषहरु जलाई दिने\n" +
                            "\n" +
                            "(ग) घुम्ती बाली पद्धती अपनाई खेती गर्ने तथा पानी निकासको उचित प्रबन्ध मिलाउनु पर्ने ।\n" +
                            "\n" +
                            "(घ)मकैका बोटहरु बाक्लो भएमा पनि रोगको आक्रमण बढी हुने हुँदा मकैको बोटको घनत्व प्रति रोपनी २६०० देखि २७०० बोट हुने गरी रोप्नु पर्दछ ।\n" +
                            "\n" +
                            "(ङ) मकै बालीमा लाग्ने प्रायजसो रोगहरु ढुसीको कारणले लाग्ने हुँदा ढुसी नासक बिषादि (रोग देखिनासाथ डाईथेन एम–४५, २.५ ग्राम÷लि. पानीका दरले १० दिनको फरकमा २—३ पटक) छरेर पनि रोग नियन्त्रण गर्न सकिन्छ ।\n" +
                            "\n" +
                            "(च) भण्डारण गर्नु अघि नै विऊलाई रोग वाट वचाउन २ ग्राम क्याप्टेन अथवा वेभिष्टिन प्रति के.जीे. विउका दरले प्रयोग गर्न सकिन्छ ।\n" +
                            "\n" +
                            "नेपालमा मकै बालीमा मुख्य गरी धर्के गवारो, गुलावी गवारो, फौजी किरा, किर्थो, खुम्रे किरा, फेद काट्ने किराहरु, लाही, धमिरा, धान चमरमा लाग्ने खपटे किराहरु लाग्ने गर्दछ । यी किराहरुको उचित व्यवस्थापनका लागि निम्नानुसारका उपायहरु अपनाउनु पर्दछ ।\n" +
                            "(क) बाली काटीसके पछि खेत बारीलाई गहिरो गरी जोतिदिँदा माटो भित्र बस्ने किराहरु सतहमा निस्कीन्छन र चराहरुले आहारा बनाउछन तथा कतिपय किराहरु घामको किरणले पनि नष्ट हुन्छन् ।\n" +
                            "(ख) बाली लगाउनु अघि वा बाली लगाए पछि खेतबारीमा पानी पटाउनाले माटो भित्र बसी बाली नोक्सान गर्ने किरा हरु नष्ट हुन्छन् ।\n" +
                            "(ग) काँचो गोबर मलमा किराहरु फैलने सम्भावना बढी हुने भएकोले राम्रो संग पाकेको गोबर मल प्रयोग गर्नु पर्दछ ।\n" +
                            "(घ) बाली लगाइएको ठाँउमा झारपातहरु उखेली सफा राख्नु पर्दछ ।\n" +
                            "(ङ) किराहरु लाई हातले छोपेर नष्ट गर्न पनि सकिन्छ\n" +
                            "(च) प्रकास पासो (लाईट ट्रयाप), आर्कषक गन्धको पासो (फेरोमेन ट्रयाप) आदी बिधिको प्रयोग बाट पनि किराहरु नियन्त्रण गर्न सकिन्छ ।\n" +
                            "छ) किराहरुको व्यवस्थापनका लागि उचित किटनाशक विषादिको प्रयोग गर्ने जस्तै खुम्रे किरा तथा फेद काट्ने किराका लागि क्लोरोपाईरिफस (डर्सवान १०५) १ के.जी÷रोपनीका दरले मकै छर्नु भन्दा अगाडि छर्कने, फौजी किराका लागि डेल्टामेथ्रिन (डेसिस २८५ ई.सी.) २ मिलीलिटर÷लि. पानीमा मिसाई छर्ने र गवारोको आक्रमण देखिएमा थायोडान वा फ्यूराडेन ३÷४ दानाको दरले प्रत्येक मकैको बोटको गुबोमा राखिदिनु पर्दछ ।\n" +
                            "ज) भण्डारण गर्नु अघि नै विऊलाई किरावाट वचाउन २ ग्राम मालाथिएनको धुलो प्रति के.जीे. विउका दरले प्रयोग गर्न सकिन्छ ।\n" +
                            "\n" +
                            "धानचमरा हटाउने\n" +
                            "फुलहरुको विकासक्रममा वढि प्रोटिनको उपयोग हुन जाने भएकाले भालेफुलहरुलाई हटाईदिंदा प्रोटिन ज्यादा खर्च हुनवाट जोगिन गई करिव ११ देखि २०% सम्म उत्पादन वढ्नुका साथै हटाईएका धानचमरा उच्च प्रोटिनयुक्त पशु आहाराको रुपमा प्रयोग गर्न सकिन्छ । खासगरी प्रजनन् बीउ र वर्णशंकर (hybrid) मकै उत्पादनमा धान चमरा हटाउने प्रविधि निकै महत्वपूर्ण र प्रभावकारी मानिन्छ । धानचमरा राम्ररी बाहिर निस्केपछि (धानचमरा देखिएको १–२ दिनपछि) तर परागकणहरु विकसित भई फैलनु अगावै धानचमरा हटाउनु पर्दछ । तर कुनै कुनै मकैका जातहरुमा धानचमरा फक्रेर बाहिर निस्कनु पूर्व नै परागकणहरु विकास हुने हुँदा त्यस्ता बोटहरुमा गुबो भित्रबाट निकालेर फ्याँक्नु पर्दछ । यसरी धानचमरा निकाल्ने क्रममा कहिले काँही माथिका पातहरु (झण्डेपात) पनि सँगसँगै आउनगई मकैको उत्पादनमा ह्रास आउने हुँदा सो कुरामा असाध्यै सावधानी अपनाउनु पर्दछ । लगाईएको जातको धानचमराको आकार, परागकणको मात्रा, मौसम र सिजनको आधारमा ५०–७०% सम्म धानचमरा हटाउन सकिन्छ । लाईनमा लगाईएको मकैमा एक छेउबाट १ लाईन छोड्ने र १ लाईनको धानचमरा निकाल्ने वा १ लाईनको छोड्ने र २ लाईनको निकाल्ने गर्न सकिन्छ । धानचमरा निकाल्दा एक हातले ढोडलाई बलियो गरी समाती अर्को हातले धान चमरालाई सिधा माथितिर तान्दै निकाल्नु पर्दछ ।"+
                            "मकै भाँच्ने\n" +
                            "मकैको घोगा पुष्ट भएर खोसेल्टा (पोस्कर) सुकेपछि घोगा नङ्याएर बिचको दाना निकाली नाथ्री कोट्याएर हेर्दा कालो तह देखियो भने मकै पाकेको छ भन्ने बुझिन्छ तथा मकै भााच्न योग्य हुन्छ । यो अवस्थामा मकैको चिस्यान २० प्रतिशत सम्म हुनु पर्दछ । मकै राम्रो संग नपाक्दै भाँचिएमा भन्डारणमा किराको समस्या बढी हुने, उमार शक्ति न्यून हुने, भन्डारणमा कुहिने आदि समस्याहरु बढी हुन्छ ।");
    insert_Suggestion(db,"Cucumber",
            "काक्रो बालीको लागि १०००–१५०० के.जी. प्रति कठाको दरले कम्पोस्ट वा गोबर मल प्रयोग गर्नुपर्दछ । १००: ५०:५० नाइट्रोजन फस्फोरस र पोटासियम के.जी. प्रति हेक्टर । कम्पोस्ट मल , डि.ए.पी. ३.६ के.जी. र पोटास मल २.६६ के.जी. जग्गा तयारी गर्न बेलामा (Basal dose) राख्ने र बाकी २.२७ के.जी. यूरिया Top Dressing को लागि प्रयोग गर्नुपर्दछ ।",
            "",
            "काक्रो Cucurbitaceae परिवारमा पर्दछ । यसको वैज्ञानिक नाम Cucumis sativus हो । यो एक वर्षीय बाली हो यसको उत्पति नेपाल र भारतको दक्षिण पूर्वी भागमा भएको मानिन्छ । काक्रो फर्सी समूहका तरकारी बालीहरु गृष्मकालीन (Summer Vegetables) समूहमा पर्दछ । यसको खेती पहाड देखि तराई सम्म गर्न सकिन्छ । यसले अत्याधिक चिसो र तुषारो सहन सक्दैन। काक्रो पौष्टिदृष्किोणले महत्वपूर्ण मानिन्छ । यसमा भिटामिन बी, सी, क्यालसियम र फोस्फरस पाईन्छ । यसलाई सलादको रुपमा र अचार बनाउन प्रयोग गरिन्छ । काक्रोमा पानीको मात्रा प्रशस्त हुन्छ र यसले कब्जियत हुनबाट बचाउँछ ।\n" +
                    "\n" +
                    "हावापानी \n" +
                    "काक्रो न्यानो तथा गर्मी मौसमको बाली भएकोले यसलाई लामो समय सम्म न्यानो तापक्रमको आवश्यक पर्दछ । यसको बोट बृद्धि र फल लाग्न सरदर २५ देखि ३० डिग्री.से. तापक्रम आवश्यक हुन्छ । रातको तापक्रम १० ० से. भन्दा कम भएमा फल लाग्दैन फल लागि हाले पनि वांगाटिङ्गा र साना आकारका हुन सक्छन् । वीउ उम्रन फल छिटो परिपक्क हुन र राम्रो उत्पादनको लागि माटोको तापक्रम महत्वपूर्ण हुन्छ । माटोको तापक्रम १० डिग्री.से. भन्दा कम र २५ डिग्री.से. भन्दा माथि हुनुहुदैन ।\n" +
                    "\n" +
                    "वानस्पति विवरण \n" +
                    "काक्रोको बोट कम लहरादेखि बढी लहरा जाने हाँगा हुने, पातहरु साधारण ३–५ वटा खण्ड (Lobed) भएका विभिन्न आकारका हुन्छन् । पातको फेदबाट त्यान्द्राहरु (Tendrils) निस्कन्छन् । काक्रो बोटको जरा लामो, गहिरो सम्म जाने (Taproot) संग फलिएका सहायक जरा हुन्छन् । एउटै बोटमा भाले र पोथी फूलहरु हुन्छन् । मुख्य लहराको लम्बाई र हांगा हाल्ने क्षमता जात अनुसार फरक हुन्छ । स्वभावत मुख्य लहरामा धेरै भाले फुल लाग्दछ भने शाखा लहराहरुमा पोथी फुलको संख्या बढी हुन्छ । खेती गरिने समयको तापक्रम र दिनको लम्बाईको अवस्थाले फुल लाग्ने प्रक्रियामा असर पार्दछ । जाडो यामको ठण्डी तापक्रम र छोटो दिनको अवस्थामा खेती गरिने काक्राका जातहरुमा मुख्या लहरामा प्रशस्त पोथी फुलहरु लाग्दछन् । लामा दिनको अवस्थामा खेती गरिने जातमा भनिने पोथी फुलहरु मुख्य लहरामा नलागि शाखा लहरामा पहिला आंख्लाहरुमा लाग्दछ ।\n" +
                    "\n" +
                    "माटो \n" +
                    "काक्रो खेतीको लागि बलौटे दोभट देखि पांगो माटो उपयुक्त हुन्छ । ५.५ देखि ६.५ पी.एच. भएको माटो उत्तम मानिन्छ । काक्रो वाली ५.५ पि.एच. भन्दा कम अर्थात अम्लिय माटोमा सम्बेदनशिल हुन्छ, बिरुवा र उत्पादनमा असर पर्दछ । चिम्टाइलो माटोमा लहरा धेरै जाने र फल ढिलो परिपक्क हुन सक्दछ ।\n" +
                    "\n" +
                    "बिउ उपचार \n" +
                    "बिउ उम्रेपछि नर्सरी र खेतबारीमा रोगको प्रकोप कम गराउन र बिउबाट सर्ने रोगलाई कम गर्न बिउ उपचार गरिन्छ । प्राय जसो हाइब्रिड बिउहरु जुन प्याकिङ्ग भएर बजारमा उपलब्ध हुन्छ, ती सबै बीउ उपचार गरिएका हुन्छन् । तैपनी खुल्ला रुपमा बिक्री भैरहेका बिउलाई उपचार गरी रोप्नु पर्दछ । बेमिस्टीन (कार्वान्डाजिम) अथवा कपर अक्सिक्लोराइड मध्ये कुनै एक विषादी १ किलो बिउमा २–३ ग्रामको दरले बिर्को बन्द बट्टामा राखी हलाई मिसाउनु पर्दछ । १०–१५ मिनट सम्म बट्टामा नै राखी मात्र प्रयोग गर्नु पर्दछ ।\n" +
                    "\n" +
                    "बिउ दर \n" +
                    "प्रति कठा २०–३० ग्राम (हाइव्रिड) र ओपी जात ५०–६० ग्राम।\n" +
                    "\n" +
                    "रोप्ने समय \n" +
                    "काक्रोको मुख्य बाली वर्षमा दुई पटक लगाइन्छ । माघ, फागुन र बैशाख जेष्ठमा ।\n" +
                    "तराईमा मध्य पहाडमा उच्च पहाडमा\n" +
                    "माघ देखि जेष्ठ फागुन देखि बैशाख बैशाख–जेष्ठ\n" +
                    "\n" +
                    "रोप्ने दुरी \n" +
                    "पंक्ति देखि पंक्तिको दुरी २ मिटर र बोट देखि बोटको दुरी १ मिटर ।\n" +
                    "\n" +
                    "रोप्ने तरिका \n" +
                    "३०–४० से.मि. गहिरो खाडल खनी सिफारिस मात्राको मलखाद प्रयोग गर्नुपर्दछ । ३–४ दिन पछि २ दाना बिउ पर्ने गरी २–३ से.मि. गहिरो बिउ रोप्नु पर्दछ ।"+
                    "गोडमेल \n" +
                    "आवश्यकता अनुसार झारपात देखिए पछि गोडमेल गर्नुपर्दछ । बिरुवा ठूलो भई फुल्न थाले पछि हातले झारपात उखेलि दिनु पर्दछ । कुटो कोदालोले जरा या काण्डमा घाउ लाग्नु हुदैन । घाउ लागेमा रोगको आक्रमणको संभावना हुन्छ । बिरुवा खेतबारीमा सारेको ३ दिनभित्र पेन्डीमेथालिन नामक झारपातनाशक विषादी ३ मि.लि./प्रति लि. पानीको दरले करिब २५–२६ लि.झोल प्रति कठा प्रयोग गरेमा धेरै हदसम्म झारपात नियन्त्रण गर्न सकिन्छ ।\n" +
                    "\n" +
                    "सिचाँई \n" +
                    "वसन्त कालिन बालीमा पटक–पटक सिचाई गर्नु महत्वपूर्ण हुन्छ, भने वर्षातमा हुने बालीमा त्यति आवश्यक हुदैन । जग्गामा बिउ रोप्नु भन्दा २ दिन अगाडि सिचाई गर्नु उपयुक्त हुन्छ र त्यसपछि बिरुवा वा बिउ रोपेको ४–५ दिन पछि हल्का सिचाई गर्नु पर्दछ । त्यसपछि माटोको चिस्यान हेरेर ६–७ दिनको फरकमा सिचाई गर्नु पर्दछ । लहरा जाने र फुल फुल्ने समयमा पानीको निकै आवश्यकता पर्दछ । सिचाई गर्दा पानी धेरै बेर सम्म जम्ने किसिमले अर्थात जम्ने गरी गर्नु हुदैन ।\n" +
                    "\n" +
                    "थाक्रा दिने / छापो हाल्ने\n" +
                    "यो बाली लहरा जाने हुदाँ थाक्रा दिनु आवश्यक हुन्छ । हिउँदमा थाक्रा दिन सकिएन भने बिरुवाको वरिपरि परालले छापो हालि दिनुपर्दछ । काक्रो को पहिलो मुन्टा चुडिदिएमा धेरै लहरा निस्कन्छ र बढी फल लाग्दछ ।");
        insert_Suggestion(db,"Onion",
                "",
                "",
                "");
        insert_Suggestion(db,"Garlic",
                "",
                "",
                "");
    }
    @Override
    public void onUpgrade(SQLiteDatabase db,int oldVersion,int newVersion){

    }
    private void insert_Suggestion(SQLiteDatabase db,String crop_name,String fertilizer, String Storage, String plating_suggestion ){

        ContentValues info_data= new ContentValues();
        info_data.put("Crop_name",crop_name);
        info_data.put("Fertilizer",fertilizer);
        info_data.put("Storage",Storage);
        info_data.put("Planting_Procedure",plating_suggestion);
        db.insert("cropSuggestion",null,info_data);
    }
   private void insert_Data(SQLiteDatabase db,String name,float tempmax,float tempmin,float humiditymax,
                             float humidity_min,float phmax,float phmin,float rainmax,
                             int T2H,int Sunshine){

       ContentValues crop_data= new ContentValues();
        crop_data.put("Crop_Name",name);
        crop_data.put("Temp_Max",tempmax);
        crop_data.put("Temp_Min",tempmin);
        crop_data.put("Humidity_Max",humiditymax);
        crop_data.put("Humidity_Min",humidity_min);
        crop_data.put("PH_Max",phmax);
        crop_data.put("PH_Min",phmin);
        crop_data.put("Rain",rainmax);

        crop_data.put("Time_To_Harvest",T2H);
        crop_data.put("Sunshine_Days",Sunshine);
        db.insert("variables",null,crop_data);
 //       database.close();
    }

   /*private static void insert_Data(SQLiteDatabase db,String name,int tempmax,int tempmin,int humiditymax,
                            int humidity_min,int phmax,int phmin,int rainmax,
                            int T2H,int Sunshine){


       ContentValues crop_data= new ContentValues();
       crop_data.put("Crop_Name",name);
       crop_data.put("Temp_Max",tempmax);
       crop_data.put("Temp_Min",tempmin);
       crop_data.put("Humidity_Max",humiditymax);
       crop_data.put("Humidity_Min",humidity_min);
       crop_data.put("PH_Max",phmax);
       crop_data.put("PH_Min",phmin);
       crop_data.put("Rain",rainmax);

       crop_data.put("Time_To_Harvest",T2H);
       crop_data.put("Sunshine_Days",Sunshine);
       db.insert("variables",null,crop_data);
      // db.close();
   }



*/
//#not my code copied to see the contents of the table in database
    public ArrayList<Cursor> getData(String Query){
        //get writable database
        SQLiteDatabase sqlDB = this.getWritableDatabase();
        String[] columns = new String[] { "mesage" };
        //an array list of cursor to save two cursors one has results from the query
        //other cursor stores error message if any errors are triggered
        ArrayList<Cursor> alc = new ArrayList<Cursor>(2);
        MatrixCursor Cursor2= new MatrixCursor(columns);
        alc.add(null);
        alc.add(null);


        try{
            String maxQuery = Query ;
            //execute the query results will be save in Cursor c
            Cursor c = sqlDB.rawQuery(maxQuery, null);


            //add value to cursor2
            Cursor2.addRow(new Object[] { "Success" });

            alc.set(1,Cursor2);
            if (null != c && c.getCount() > 0) {


                alc.set(0,c);
                c.moveToFirst();

                return alc ;
            }
            return alc;
        } catch(SQLException sqlEx){
            Log.d("printing exception", sqlEx.getMessage());
            //if any exceptions are triggered save the error message to cursor an return the arraylist
            Cursor2.addRow(new Object[] { ""+sqlEx.getMessage() });
            alc.set(1,Cursor2);
            return alc;
        } catch(Exception ex){

            Log.d("printing exception", ex.getMessage());

            //if any exceptions are triggered save the error message to cursor an return the arraylist
            Cursor2.addRow(new Object[] { ""+ex.getMessage() });
            alc.set(1,Cursor2);
            return alc;
        }


    }
}

